fatihsengezer/esp32homecontrol-ws/espbackend/src/main.cpp
#include <WiFi.h>
#include <WiFiUdp.h>
#include <WebSocketsClient.h>
#include <WiFiClientSecure.h>
#include <Preferences.h>
#include <ArduinoJson.h>
#include <string.h>  // memset için
#include "password.h"
#include "Buzzer.h"
#include "StatusLED.h"
// Cihaz konfigürasyonunu seçin (SelectedDevice.h üzerinden tek noktadan yönetilir)
#include "../device_configs/SelectedDevice.h"
#include "DeviceConfig.h"
#include <ESP32Ping.h> // Ping için gerekli
#include "wifi_setup.h" // WiFi setup GUI

// Sabit IP ayarları
IPAddress local_IP(192, 168, 1, 150);
IPAddress gateway(192, 168, 1, 1);
IPAddress subnet(255, 255, 255, 0);
IPAddress primaryDNS(8, 8, 8, 8);
IPAddress secondaryDNS(8, 8, 4, 4);

// Relay pins - DeviceConfig.h'den alınıyor

WiFiUDP udp;
WebSocketsClient webSocket;

// Komut debouncing ve relay cooldown kontrolü
static String lastRelayCmd = "";
static unsigned long lastRelayCmdTime = 0;
static unsigned long relayCooldownUntil[RELAY_COUNT] = {0};

// ----------------- WOL -----------------
void sendWOL(const WOLDevice &dev) {
  byte packet[102];
  for (int i = 0; i < 6; i++) packet[i] = 0xFF;
  for (int i = 1; i <= 16; i++) memcpy(&packet[i * 6], dev.mac, 6);

  udp.beginPacket(dev.broadcast, dev.port > 0 ? dev.port : 9);
  udp.write(packet, sizeof(packet));
  udp.endPacket();
}

// ----------------- WOL Persist -----------------
Preferences wolPrefs;

static bool parseMac(const String &macStr, byte out[6]) {
  int values[6];
  if (sscanf(macStr.c_str(), "%x:%x:%x:%x:%x:%x", &values[0], &values[1], &values[2], &values[3], &values[4], &values[5]) != 6) return false;
  for (int i = 0; i < 6; i++) out[i] = (byte)values[i];
  return true;
}

void loadWOLProfilesFromPrefs() {
  if (!wolPrefs.begin("wolconfig", true)) {
    Serial.println("⚠️ WOL Preferences açılamadı, compile-time profiller kullanılacak");
    return;
  }
  String json = wolPrefs.getString("profiles", "");
  wolPrefs.end();
  
  if (json.length() == 0) {
    Serial.println("ℹ️ WOL profilleri Preferences'ta yok, compile-time profiller kullanılıyor");
    return;
  }

  Serial.println("📥 WOL profilleri Preferences'tan yükleniyor...");
  StaticJsonDocument<2048> doc;
  DeserializationError err = deserializeJson(doc, json);
  if (err) {
    Serial.println("❌ WOL profilleri parse edilemedi: " + String(err.c_str()));
    return;
  }
  if (!doc.is<JsonArray>()) {
    Serial.println("❌ WOL profilleri JSON array değil");
    return;
  }

  JsonArray arr = doc.as<JsonArray>();
  int count = 0;
  IPAddress defaultBroadcast;
  defaultBroadcast.fromString(String(WOL_BROADCAST_IP));
  
  // Önce tüm cihazları temizle (compile-time initialization'ı sıfırla)
  for (int i = 0; i < MAX_WOL_DEVICES; i++) {
    strncpy(wolDevices[i].name, "", 32);  // String'i temizle
    wolDevices[i].name[0] = '\0';
    memset(wolDevices[i].mac, 0, 6);
    wolDevices[i].ip = IPAddress(0, 0, 0, 0);
    wolDevices[i].broadcast = defaultBroadcast;
    wolDevices[i].port = 9;
    wolDevices[i].status = WOLDevice::OFFLINE;
    wolDevices[i].bootStartTime = 0;
  }
  
  // JSON'dan yükle
  for (JsonObject p : arr) {
    if (count >= MAX_WOL_DEVICES) {
      Serial.println("⚠️ MAX_WOL_DEVICES limitine ulaşıldı, fazla profiller yüklenmedi");
      break;
    }
    
    String name = p["name"].as<String>();
    String mac = p["mac"].as<String>();
    String bcast = p["broadcast_ip"] | String(WOL_BROADCAST_IP);
    uint16_t port = p["port"] | 9;
    String ipStr = p["ip"] | "0.0.0.0";

    // Name'i direkt olarak kopyala (struct'ta artık char name[32] var)
    name.toCharArray(wolDevices[count].name, 32);
    
    byte macb[6] = {0};
    if (parseMac(mac, macb)) {
      memcpy(wolDevices[count].mac, macb, 6);
    } else {
      Serial.println("❌ Geçersiz MAC adresi: " + mac);
      continue; // Bu profili atla
    }
    
    IPAddress ip;
    ip.fromString(ipStr);
    wolDevices[count].ip = ip;
    
    IPAddress bc;
    if (bcast.length() > 0) {
      bc.fromString(bcast);
      wolDevices[count].broadcast = bc;
    } else {
      wolDevices[count].broadcast = defaultBroadcast;
    }
    
    wolDevices[count].port = port > 0 ? port : 9;
    wolDevices[count].status = WOLDevice::OFFLINE;
    wolDevices[count].bootStartTime = 0;
    
    Serial.println("✅ WOL profili yüklendi: " + name + " (" + mac + ")");
    count++;
  }
  
  wolDeviceCount = count;
  Serial.println("📦 Toplam " + String(count) + " WOL profili yüklendi");
}

bool saveWOLProfilesToPrefs(const String &json) {
  StaticJsonDocument<2048> doc;
  if (deserializeJson(doc, json)) return false;
  if (!doc.is<JsonArray>()) return false;
  if (!wolPrefs.begin("wolconfig", false)) return false;
  wolPrefs.putString("profiles", json);
  wolPrefs.end();
  return true;
}

bool updateWOLProfilesFromJson(const String &json) {
  if (!saveWOLProfilesToPrefs(json)) return false;
  loadWOLProfilesFromPrefs();
  return true;
}

// ----------------- Yardımcı: Mesaj ID kontrolü -----------------
// Mesaj içinde " id:<DEVICE_ID>" varsa ve bizim cihaz ID'miz ile eşleşmiyorsa true döner (yani bu cihaza ait değil)
bool hasIdButNotForThisDevice(const String &msg) {
  int idPos = msg.indexOf(" id:");
  if (idPos == -1) return false; // ID belirtilmemiş, geriye dönük uyumluluk: kabul et
  int start = idPos + 4; // " id:" sonrası
  int end = msg.indexOf(' ', start);
  if (end == -1) end = msg.length();
  String targetId = msg.substring(start, end);
  targetId.trim();
  return targetId.length() > 0 && targetId != String(DEVICE_ID);
}

// MAC adresini string formatına çevir (AA:BB:CC:DD:EE:FF)
String macToString(byte mac[6]) {
  String result = "";
  for (int i = 0; i < 6; i++) {
    if (i > 0) result += ":";
    if (mac[i] < 16) result += "0";
    result += String(mac[i], HEX);
  }
  result.toUpperCase();
  return result;
}

// ----------------- Cihaz yeteneklerini gönder -----------------
void sendCapabilities() {
  // JSON: { type:"capabilities", deviceId, relayCount, wol:[{index,name},...] }
  String json = "{";
  json += "\"type\":\"capabilities\",";
  json += "\"deviceId\":\"" + String(DEVICE_ID) + "\",";
  json += "\"relayCount\":" + String(RELAY_COUNT) + ",";
  json += "\"wol\":[";
  for (int i = 0; i < wolDeviceCount; i++) {
    json += "{\"index\":" + String(i) + ",\"name\":\"" + String(wolDevices[i].name) + "\"}";
    if (i < wolDeviceCount - 1) json += ",";
  }
  json += "]";
  json += "}";
  webSocket.sendTXT(json);
  Serial.println("📤 Capabilities gönderildi: " + json);
}

// ----------------- WOL profillerini detaylı gönder -----------------
void sendWOLProfiles() {
  // JSON: { type:"wol_profiles", deviceId, profiles:[{name,mac,ip,broadcast,port},...] }
  StaticJsonDocument<4096> doc;
  doc["type"] = "wol_profiles";
  doc["deviceId"] = String(DEVICE_ID);
  JsonArray profiles = doc.createNestedArray("profiles");
  
  for (int i = 0; i < wolDeviceCount; i++) {
    JsonObject profile = profiles.createNestedObject();
    profile["index"] = i;
    profile["name"] = String(wolDevices[i].name);
    profile["mac"] = macToString(wolDevices[i].mac);
    profile["ip"] = wolDevices[i].ip.toString();
    profile["broadcast_ip"] = wolDevices[i].broadcast.toString();
    profile["port"] = wolDevices[i].port;
    
    // Status bilgisi
    String statusStr;
    switch(wolDevices[i].status) {
      case WOLDevice::OFFLINE: statusStr = "OFFLINE"; break;
      case WOLDevice::BOOTING: statusStr = "BOOTING"; break;
      case WOLDevice::RUNNING: statusStr = "RUNNING"; break;
      case WOLDevice::FAILED:  statusStr = "FAILED"; break;
      default: statusStr = "UNKNOWN"; break;
    }
    profile["status"] = statusStr;
  }
  
  String output;
  serializeJson(doc, output);
  webSocket.sendTXT(output);
  Serial.println("📤 WOL profilleri gönderildi (" + String(wolDeviceCount) + " profil): " + output);
}

// ----------------- Status gönder -----------------
void sendStatus(WOLDevice &dev) {
  String statusStr;
  switch(dev.status) {
    case WOLDevice::OFFLINE: statusStr = "OFFLINE"; break;
    case WOLDevice::BOOTING: statusStr = "BOOTING"; break;
    case WOLDevice::RUNNING: statusStr = "RUNNING"; break;
    case WOLDevice::FAILED:  statusStr = "FAILED"; break;
  }
  webSocket.sendTXT("status:" + String(dev.name) + ":" + statusStr);
}

// ----------------- Tüm status gönder -----------------
void sendAllStatuses() {
  for (int i = 0; i < wolDeviceCount; i++) {
    sendStatus(wolDevices[i]);
  }
}

