fatihsengezer/esp32homecontrol-ws/espbackend/src/main.cpp
// ----------------- Röle durumlarını gönder -----------------
void getRelayStatus() {
  for (int i = 0; i < RELAY_COUNT; i++) {
    String state = deviceStatus.relays[i].state ? "on" : "off";
    webSocket.sendTXT("relay:" + String(i) + ":" + state + " id:" + String(DEVICE_ID));
    Serial.println("relay:" + String(i) + ":" + state);
  }
}

// ----------------- Röle kontrol (WebSocket ile) -----------------
void setRelayWithWebSocket(int index, bool state) {
  if (index < 0 || index >= RELAY_COUNT) return;
  
  // Durum zaten istenen ile aynıysa tekrar işlem yapma
  if (deviceStatus.relays[index].state == state) {
    return;
  }
  
  // Hızlı tekrarlara karşı per-relay cooldown (200 ms)
  unsigned long nowMs = millis();
  if (relayCooldownUntil[index] > nowMs) {
    return;
  }
  relayCooldownUntil[index] = nowMs + 200;

  // Röleyi kontrol et
  digitalWrite(relayPins[index], state ? HIGH : LOW);
  deviceStatus.relays[index].state = state;
  deviceStatus.relays[index].lastChange = millis();
  
  // Durumu WebSocket'e gönder
  String stateStr = state ? "on" : "off";
  webSocket.sendTXT("relay:" + String(index) + ":" + stateStr + " id:" + String(DEVICE_ID));
  
  Serial.println("Röle " + String(index) + " " + (state ? "AÇILDI" : "KAPANDI"));
  Serial.println("relay:" + String(index) + ":" + stateStr);
  ledFlash();
}

void toggleRelayWithWebSocket(int index) {
  if (index < 0 || index >= RELAY_COUNT) return;
  setRelayWithWebSocket(index, !deviceStatus.relays[index].state);
}

// ----------------- Ping kontrolü -----------------
void checkDevices() {
  static unsigned long lastFastPing = 0;
  static unsigned long lastSlowPing = 0;
  static unsigned long lastOfflinePing = 0;

  unsigned long now = millis();

  // 1️⃣ BOOTING cihazlar: hızlı ping (500 ms)
  if (now - lastFastPing >= 500) {
    lastFastPing = now;
    for (int i = 0; i < wolDeviceCount; i++) {
      WOLDevice &dev = wolDevices[i];
      if (dev.status == WOLDevice::BOOTING) {
        if (Ping.ping(dev.ip, 1)) {
          dev.status = WOLDevice::RUNNING;
          sendStatus(dev);
        }
      }
    }
  }

  // 2️⃣ RUNNING cihazlar: hafif ping (5 s)
  if (now - lastSlowPing >= 5000) {
    lastSlowPing = now;
    for (int i = 0; i < wolDeviceCount; i++) {
      WOLDevice &dev = wolDevices[i];
      if (dev.status == WOLDevice::RUNNING) {
        if (!Ping.ping(dev.ip, 1)) {
          dev.status = WOLDevice::OFFLINE;
          sendStatus(dev);
        }
      }
    }
  }

  // 3️⃣ OFFLINE cihazlar: arada ping (5 dk)
  if (now - lastOfflinePing >= 300000) {
    lastOfflinePing = now;
    for (int i = 0; i < wolDeviceCount; i++) {
      WOLDevice &dev = wolDevices[i];
      if (dev.status == WOLDevice::OFFLINE) {
        if (Ping.ping(dev.ip, 1)) {
          dev.status = WOLDevice::RUNNING;
          sendStatus(dev);
        }
      }
    }
  }
}

// ----------------- JSON değer alma (basit) -----------------
String getValue(String data, String key) {
  int start = data.indexOf("\"" + key + "\":");
  if (start == -1) return "";
  start += key.length() + 3;
  int end = data.indexOf(",", start);
  if (end == -1) end = data.indexOf("}", start);
  return data.substring(start, end);
}

// ----------------- Device Token Management -----------------
String deviceToken = "";
String pairingToken = "";
bool isPaired = false;
Preferences tokenPrefs;

// Token kaydetme (Preferences - kalıcı depolama)
void saveToken(String token) {
  // Token'daki çift tırnakları temizle
  deviceToken = token;
  deviceToken.replace("\"", "");
  
  // Preferences'a kaydet (kalıcı)
  if (tokenPrefs.begin("devicetoken", false)) {
    tokenPrefs.putString("token", deviceToken);
    tokenPrefs.end();
    Serial.println("✅ Token kaydedildi (Preferences): " + deviceToken.substring(0, 8) + "...");
  } else {
    Serial.println("❌ Token Preferences açılamadı");
  }
}

// Token yükleme (Preferences'tan)
String loadToken() {
  if (tokenPrefs.begin("devicetoken", true)) {
    String savedToken = tokenPrefs.getString("token", "");
    tokenPrefs.end();
    if (savedToken.length() > 0) {
      deviceToken = savedToken;
      Serial.println("✅ Token yüklendi (Preferences): " + deviceToken.substring(0, 8) + "...");
      return deviceToken;
    } else {
      Serial.println("ℹ️ Preferences'ta kayıtlı token yok");
    }
  } else {
    Serial.println("❌ Token Preferences açılamadı");
  }
  return "";
}

// ----------------- Config Handling -----------------
struct DeviceConfig {
  String wifi_ssid = "";
  String wifi_pass = "";
  bool use_dhcp = true;
  String static_ip = "";
  String wol_profiles = "[]"; // JSON string
};

DeviceConfig currentConfig;

// Config'i uygula
void applyConfig(const DeviceConfig& config) {
  Serial.println("=== Konfigürasyon Uygulanıyor ===");
  
  // WiFi ayarlarını güncelle
  if (config.wifi_ssid.length() > 0 && config.wifi_pass.length() > 0) {
    Serial.println("WiFi ayarları güncelleniyor...");
    // TODO: WiFi ayarlarını güncelle ve yeniden bağlan
    // WiFi.begin(config.wifi_ssid.c_str(), config.wifi_pass.c_str());
  }
  
  // IP ayarlarını güncelle
  if (!config.use_dhcp && config.static_ip.length() > 0) {
    Serial.println("Statik IP ayarlanıyor: " + config.static_ip);
    // TODO: Statik IP ayarla
  }
  
  // WOL profillerini güncelle
  if (config.wol_profiles.length() > 0) {
    Serial.println("WOL profilleri güncelleniyor...");
    // TODO: WOL profillerini parse et ve güncelle
  }
  
  currentConfig = config;
  Serial.println("Konfigürasyon uygulandı");
}

// Config ACK mesajı gönder
void sendConfigAck(String requestId, bool success, String errorMsg = "") {
  String ackMsg = "{";
  ackMsg += "\"type\":\"config_applied\",";
  ackMsg += "\"device_id\":\"" + String(DEVICE_ID) + "\",";
  ackMsg += "\"request_id\":\"" + requestId + "\",";
  ackMsg += "\"status\":\"" + String(success ? "ok" : "error") + "\",";
  ackMsg += "\"details\":{";
  ackMsg += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
  ackMsg += "\"mac\":\"" + WiFi.macAddress() + "\"";
  ackMsg += "},";
  ackMsg += "\"timestamp\":\"" + String(millis()) + "\"";
  if (!success && errorMsg.length() > 0) {
    ackMsg += ",\"error\":\"" + errorMsg + "\"";
  }
  ackMsg += "}";
  
  webSocket.sendTXT(ackMsg);
  Serial.println("Config ACK gönderildi: " + ackMsg);
}

