fatihsengezer/esp32homecontrol-ws/espbackend/src/main.cpp
// Config mesajını işle
void handleConfigMessage(String message) {
  Serial.println("Config mesajı alındı: " + message);

  // Önce ArduinoJson ile sağlam parse dene
  StaticJsonDocument<4096> doc;
  DeserializationError err = deserializeJson(doc, message);
  if (!err) {
    String requestId = doc["meta"]["request_id"].as<String>();
    String token = doc["token"].as<String>();

    // Token doğrulama (detaylı loglama ile)
    Serial.println("🔐 Token kontrolü:");
    Serial.println("   - Gelen token: " + token.substring(0, 8) + "... (length: " + String(token.length()) + ")");
    Serial.println("   - deviceToken: " + (deviceToken.length() > 0 ? deviceToken.substring(0, 8) + "... (length: " + String(deviceToken.length()) + ")" : "BOŞ"));
    Serial.println("   - pairingToken: " + (pairingToken.length() > 0 ? pairingToken.substring(0, 8) + "... (length: " + String(pairingToken.length()) + ")" : "BOŞ"));
    
    // Token boşsa veya eşleşmiyorsa
    if (token.length() > 0) {
      bool tokenValid = false;
      
      // deviceToken ile karşılaştır
      if (deviceToken.length() > 0 && token == deviceToken) {
        tokenValid = true;
        Serial.println("   ✅ Token eşleşti (deviceToken)");
      }
      
      // pairingToken ile karşılaştır
      if (!tokenValid && pairingToken.length() > 0 && token == pairingToken) {
        tokenValid = true;
        Serial.println("   ✅ Token eşleşti (pairingToken)");
      }
      
      if (!tokenValid) {
        Serial.println("   ❌ Geçersiz token - eşleşme bulunamadı");
        sendConfigAck(requestId, false, "Geçersiz token");
        return;
      }
    } else {
      Serial.println("   ⚠️ Token boş, ancak işleme devam ediliyor");
    }

    JsonVariant cfg = doc["config"];
    if (cfg.isNull()) {
      Serial.println("Config JSON bulunamadı");
      sendConfigAck(requestId, false, "Config JSON bulunamadı");
      return;
    }

    DeviceConfig newConfig;
    newConfig.wifi_ssid = cfg["wifi_ssid"].as<String>();
    newConfig.wifi_pass = cfg["wifi_pass"].as<String>();
    // use_dhcp true/false olabilir
    if (!cfg["use_dhcp"].isNull()) newConfig.use_dhcp = cfg["use_dhcp"].as<bool>();
    newConfig.static_ip = cfg["static_ip"].isNull() ? String("") : cfg["static_ip"].as<String>();

    // wol_profiles dizi ya da string olabilir
    if (!cfg["wol_profiles"].isNull()) {
      if (cfg["wol_profiles"].is<JsonArray>()) {
        String arrStr;
        serializeJson(cfg["wol_profiles"], arrStr);
        newConfig.wol_profiles = arrStr;
        Serial.println("📦 WOL profilleri alındı (JSON array): " + arrStr.substring(0, min(100, (int)arrStr.length())) + "...");
      } else if (cfg["wol_profiles"].is<const char*>()) {
        newConfig.wol_profiles = String(cfg["wol_profiles"].as<const char*>());
        Serial.println("📦 WOL profilleri alındı (string): " + newConfig.wol_profiles.substring(0, min(100, (int)newConfig.wol_profiles.length())) + "...");
      }
    }

    if (newConfig.wol_profiles.length() > 0) {
      Serial.println("🔄 WOL profilleri güncelleniyor...");
      if (updateWOLProfilesFromJson(newConfig.wol_profiles)) {
        Serial.println("✅ WOL profilleri güncellendi ve kaydedildi (" + String(wolDeviceCount) + " profil)");
      } else {
        Serial.println("❌ WOL profilleri güncellenemedi (parse/persist hatası)");
      }
    } else {
      Serial.println("ℹ️ WOL profilleri config'de yok, mevcut profiller korunuyor");
    }

    applyConfig(newConfig);
    sendConfigAck(requestId, true);
    return;
  }

  // Geriye dönük uyumluluk: basit parser
  String requestId = getValue(message, "request_id");
  String token = getValue(message, "token");

  // Token doğrulama (fallback parser için)
  Serial.println("🔐 Token kontrolü (fallback parser):");
  Serial.println("   - Gelen token: " + (token.length() > 8 ? token.substring(0, 8) + "..." : token) + " (length: " + String(token.length()) + ")");
  Serial.println("   - deviceToken: " + (deviceToken.length() > 0 ? deviceToken.substring(0, 8) + "... (length: " + String(deviceToken.length()) + ")" : "BOŞ"));
  Serial.println("   - pairingToken: " + (pairingToken.length() > 0 ? pairingToken.substring(0, 8) + "... (length: " + String(pairingToken.length()) + ")" : "BOŞ"));
  
  if (token.length() > 0) {
    bool tokenValid = false;
    
    // deviceToken ile karşılaştır
    if (deviceToken.length() > 0 && token == deviceToken) {
      tokenValid = true;
      Serial.println("   ✅ Token eşleşti (deviceToken)");
    }
    
    // pairingToken ile karşılaştır
    if (!tokenValid && pairingToken.length() > 0 && token == pairingToken) {
      tokenValid = true;
      Serial.println("   ✅ Token eşleşti (pairingToken)");
    }
    
    if (!tokenValid) {
      Serial.println("   ❌ Geçersiz token - eşleşme bulunamadı");
      sendConfigAck(requestId, false, "Geçersiz token");
      return;
    }
  } else {
    Serial.println("   ⚠️ Token boş, ancak işleme devam ediliyor");
  }

  String configJson = getValue(message, "config");
  if (configJson.length() == 0) {
    Serial.println("Config JSON bulunamadı");
    sendConfigAck(requestId, false, "Config JSON bulunamadı");
    return;
  }

  DeviceConfig newConfig;
  newConfig.wifi_ssid = getValue(configJson, "wifi_ssid");
  newConfig.wifi_pass = getValue(configJson, "wifi_pass");
  newConfig.use_dhcp = getValue(configJson, "use_dhcp") == "true";
  newConfig.static_ip = getValue(configJson, "static_ip");
  newConfig.wol_profiles = getValue(configJson, "wol_profiles");

  if (newConfig.wol_profiles.length() > 0) {
    Serial.println("🔄 WOL profilleri güncelleniyor (fallback parser)...");
    if (updateWOLProfilesFromJson(newConfig.wol_profiles)) {
      Serial.println("✅ WOL profilleri güncellendi ve kaydedildi (" + String(wolDeviceCount) + " profil)");
    } else {
      Serial.println("❌ WOL profilleri güncellenemedi (parse/persist hatası)");
    }
  } else {
    Serial.println("ℹ️ WOL profilleri config'de yok, mevcut profiller korunuyor");
  }

  applyConfig(newConfig);
  sendConfigAck(requestId, true);
}

// Device identify mesajı gönder
void sendDeviceIdentify() {
  // Token'daki çift tırnakları temizle
  String cleanToken = deviceToken;
  cleanToken.replace("\"", "");
  
