fatihsengezer/esp32homecontrol-ws/espbackend/src/main.cpp
  String identifyMsg = "{";
  identifyMsg += "\"type\":\"identify\",";
  identifyMsg += "\"device_id\":\"" + String(DEVICE_ID) + "\",";
  identifyMsg += "\"firmware\":\"v1.0.0\",";
  identifyMsg += "\"token\":\"" + cleanToken + "\",";
  identifyMsg += "\"capabilities\":[\"wol\",\"wifi-config\"],";
  identifyMsg += "\"timestamp\":\"" + String(millis()) + "\"";
  identifyMsg += "}";
  
  webSocket.sendTXT(identifyMsg);
  Serial.println("Device identify gönderildi: " + identifyMsg);
}

// ----------------- WebSocket olayları -----------------
void webSocketEvent(WStype_t type, uint8_t * payload, size_t length) {
  switch(type) {
    case WStype_CONNECTED: {
      Serial.println("=== WebSocket Bağlandı ===");
      Serial.println("Server: " + String(WS_SERVER_IP) + ":" + String(WS_SERVER_PORT));
      Serial.println("Cihaz ID: " + String(DEVICE_ID));
      Serial.println("Cihaz Adı: " + String(DEVICE_NAME));
      
      // Yeni JSON heartbeat mesajı gönder
      String heartbeatMsg = createHeartbeatMessage();
      webSocket.sendTXT(heartbeatMsg);
      Serial.println("Heartbeat gönderildi: " + heartbeatMsg);
      ledFlash();
      // Bağlantı sonrası yetenekleri bildir
      sendCapabilities();
      
      // WOL profillerini de gönder (detaylı bilgi)
      sendWOLProfiles();
      
      // Device identify mesajı gönder
      sendDeviceIdentify();
      break;
    }

    case WStype_TEXT: {
      String msg = String((char*)payload);
      Serial.println("Message: " + msg);

      // Tekrarlayan röle komutlarını filtrele (debounce)
      unsigned long nowMs = millis();
      if (msg.startsWith("relay:")) {
        if (msg == lastRelayCmd && (nowMs - lastRelayCmdTime) < 300) {
          // Aynı komut kısa süre içinde tekrar geldiyse yok say
          break;
        }
        lastRelayCmd = msg;
        lastRelayCmdTime = nowMs;
      }

      // ID hedefleme kontrolü (mesajda id varsa ve bize ait değilse yok say)
      if (hasIdButNotForThisDevice(msg)) {
        break;
      }

      // --- 1️⃣ Relay kontrol ---
      if (msg.startsWith("relay:")) {
        String command = msg.substring(6);

        // 🔹 Tüm röleleri aç/kapat/toggle et
        if (command == "all:on") {
          for (int i = 0; i < RELAY_COUNT; i++) setRelayWithWebSocket(i, true);
        } 
        else if (command == "all:off") {
          for (int i = 0; i < RELAY_COUNT; i++) setRelayWithWebSocket(i, false);
        } 
        else if (command == "all") {
          for (int i = 0; i < RELAY_COUNT; i++) toggleRelayWithWebSocket(i);
        } 
        else {
          // 🔹 Tekli röle kontrol
          int idx = command.substring(0, 1).toInt();
          String action = "";
          if (command.length() > 2) action = command.substring(2);

          if (command.endsWith(":on")) {
            Serial.println("Röle " + String(idx) + " AÇILIYOR");
            setRelayWithWebSocket(idx, true);
          }
          else if (command.endsWith(":off")) {
            Serial.println("Röle " + String(idx) + " KAPATILIYOR");
            setRelayWithWebSocket(idx, false);
          }
          else {
            Serial.println("Röle " + String(idx) + " TOGGLE");
            toggleRelayWithWebSocket(idx);  // toggle desteği
          }
        }
      }
      // --- 2️⃣ Röle durumlarını isteme ---
      else if (msg.startsWith("getRelayStatus")) { // getRelayStatus [id:xxx]
        getRelayStatus();
      }

      // --- 3️⃣ WOL gönder ---
      else if (msg.startsWith("wol:")) {
        int devIndex = msg.substring(4).toInt();
        if (devIndex >= 0 && devIndex < wolDeviceCount) {
          sendWOL(wolDevices[devIndex]);
          wolDevices[devIndex].status = WOLDevice::BOOTING;
          wolDevices[devIndex].bootStartTime = millis();
          sendStatus(wolDevices[devIndex]);
          ledFlash();
        }
      }

      // --- 4️⃣ StatusCheck ---
      else if (msg.startsWith("getWolStatus")) { // getWolStatus [id:xxx]
        for (int i = 0; i < wolDeviceCount; i++) {
          WOLDevice &dev = wolDevices[i];
          if (dev.status == WOLDevice::BOOTING) {
            sendStatus(dev);
            continue;
          }

          bool reachable = Ping.ping(dev.ip, 1);
          if (reachable && dev.status != WOLDevice::RUNNING) dev.status = WOLDevice::RUNNING;
          else if (!reachable && dev.status != WOLDevice::BOOTING) dev.status = WOLDevice::OFFLINE;
          sendStatus(dev);
        }
        webSocket.sendTXT("statusCheck:done");
        ledFlash();
      }

      // --- 7️⃣ Yetenekleri isteme ---
      else if (msg.startsWith("getCapabilities")) { // getCapabilities [id:xxx]
        sendCapabilities();
      }
      
      // --- 8️⃣ WOL profillerini isteme ---
      else if (msg.startsWith("getWOLProfiles") || msg.startsWith("{\"type\":\"request_wol_profiles\"")) {
        Serial.println("📥 WOL profilleri isteği alındı");
        sendWOLProfiles();
      }

      // --- 5️⃣ Buzzer ---
      else if (msg.startsWith("{\"type\":\"buzzer\"")) {
        int pitch = getValue(msg, "pitch").toInt();
        int duration = getValue(msg, "duration").toInt();
        float volume = getValue(msg, "volume").toFloat();

        if (pitch <= 0) pitch = 2000;
        if (duration <= 0) duration = 300;
        if (volume < 0 || volume > 1) volume = 1.0;

        buzzerPlay(pitch, duration, volume);
        webSocket.sendTXT("buzzer:done");
        ledFlash();
      }

      // --- 6️⃣ LED kontrol ---
      else if (msg == "led:on") {
        ledOn();
        webSocket.sendTXT("led:done");
      }
      else if (msg == "led:off") {
        ledOff();
        webSocket.sendTXT("led:done");
      }

      // --- 7️⃣ Config mesajları ---
      else if (msg.startsWith("{\"type\":\"update_config\"")) {
        handleConfigMessage(msg);
      }
      else if (msg.startsWith("{\"type\":\"pairing_required\"")) {
        // Pairing token alındı
        String token = getValue(msg, "pairing_token");
        if (token.length() > 0) {
          pairingToken = token;
          deviceToken = token; // Pairing token'ı device token olarak kullan
          saveToken(token); // Token'ı kaydet
          Serial.println("Pairing token alındı: " + token.substring(0, 8) + "...");
          // Pairing token ile tekrar identify gönder
          delay(1000);
          sendDeviceIdentify();
        }
      }
      else if (msg.startsWith("{\"type\":\"identify_success\"")) {
        // Cihaz başarıyla tanımlandı
        Serial.println("✅ Cihaz başarıyla tanımlandı");
        isPaired = true;
        
