fatihsengezer/esp32homecontrol-ws/espbackend/src/main.cpp
        // JSON parse et (daha güvenilir)
        StaticJsonDocument<512> doc;
        DeserializationError err = deserializeJson(doc, msg);
        if (!err) {
          String persistentToken = doc["persistent_token"].as<String>();
          if (persistentToken.length() > 0) {
            deviceToken = persistentToken;
            saveToken(persistentToken);
            Serial.println("✅ Persistent token kaydedildi: " + persistentToken.substring(0, 8) + "...");
          }
        } else {
          // Fallback: basit parser
          String persistentToken = getValue(msg, "persistent_token");
          if (persistentToken.length() > 0) {
            deviceToken = persistentToken;
            saveToken(persistentToken);
            Serial.println("✅ Persistent token kaydedildi (fallback): " + persistentToken.substring(0, 8) + "...");
          } else if (pairingToken.length() > 0) {
            saveToken(pairingToken);
            Serial.println("✅ Pairing token kaydedildi: " + pairingToken.substring(0, 8) + "...");
            pairingToken = "";
          }
        }
      }

      break;
    }
  }
}

// ----------------- WiFi bağlantısı -----------------
bool connectToWiFi() {
  int rssiMax = -1000;
  int bestNetworkIndex = -1;

  int n = WiFi.scanNetworks();
  for (int i = 0; i < n; i++) {
    String ssidFound = WiFi.SSID(i);
    for (int j = 0; j < networkCount; j++) {
      if (ssidFound == networks[j].ssid) {
        int rssi = WiFi.RSSI(i);
        if (rssi > rssiMax) {
          rssiMax = rssi;
          bestNetworkIndex = j;
        }
      }
    }
  }

  if (bestNetworkIndex != -1) {
    Serial.print("Connecting to: ");
    Serial.println(networks[bestNetworkIndex].ssid);
    WiFi.begin(networks[bestNetworkIndex].ssid, networks[bestNetworkIndex].password);

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 20) {
      delay(500);
      Serial.print(".");
      ledSlowBlink(1, 200);
      attempts++;
    }

    if (WiFi.status() == WL_CONNECTED) {
      Serial.println("\nWiFi connected!");
      Serial.println(WiFi.localIP());
      ledOn();
      return true;
    }
  }

  Serial.println("No known WiFi found.");
  return false;
}

// ----------------- SETUP -----------------
void setup() {
  Serial.begin(115200);
  
  // Cihazı başlat
  initDevice();

  // WOL profillerini yükle (varsa)
  loadWOLProfilesFromPrefs();

  buzzerInit();
  ledInit();
  ledBlink(300);

  // WiFi bağlantısını dene
  Serial.println("\n=== WiFi Bağlantısı Kontrol Ediliyor ===");
  
  // Önce kaydedilmiş WiFi bilgilerini dene
  bool connected = connectToSavedWiFi();
  
  if (!connected) {
    // Kaydedilmiş WiFi bulunamadı veya bağlanılamadı
    // AP modu başlat (WiFi Setup GUI)
    Serial.println("WiFi'ye bağlanılamadı. AP modu başlatılıyor...");
    startAPMode();
    
    // AP modundayken WebSocket başlatma
    Serial.println("AP modu aktif. WiFi Setup arayüzü hazır.");
    Serial.println("192.168.4.1 adresine bağlanın.");
    return;
  }
  
  // WiFi bağlandı, WebSocket bağlantısı yap
  Serial.println("\n=== WebSocket Bağlantısı Kuruluyor ===");

  // Token'ı yükle (Preferences'tan)
  String loadedToken = loadToken();
  if (loadedToken.length() > 0) {
    deviceToken = loadedToken;
    Serial.println("✅ Kaydedilmiş token yüklendi: " + deviceToken.substring(0, 8) + "...");
  } else {
    Serial.println("ℹ️ Kayıtlı token bulunamadı - pairing gerekecek");
  }

  // WebSocket bağlantısı (WSS) - konfigürasyon dosyasından host/port alınıyor
  webSocket.beginSSL(WS_SERVER_IP, WS_SERVER_PORT, "/");
  // Ping/pong keepalive
  webSocket.enableHeartbeat(15000, 3000, 2);
  webSocket.onEvent(webSocketEvent);
  webSocket.setReconnectInterval(5000);
  
  Serial.println("Setup tamamlandı!");
}

// ----------------- WiFi Reset Komutu -----------------
void checkSerialCommands() {
  if (Serial.available()) {
    String command = Serial.readStringUntil('\n');
    command.trim();
    command.toUpperCase();
    
    if (command == "RESETWIFI") {
      Serial.println("=== WiFi Ayarları Temizleniyor ===");
      Preferences prefs;
      prefs.begin("wificonfig", false);
      prefs.clear();
      prefs.end();
      Serial.println("WiFi ayarları temizlendi! Yeniden başlatılıyor...");
      delay(1000);
      ESP.restart();
    }
  }
}

// ----------------- LOOP -----------------
void loop() {
  // Serial komutlarını kontrol et
  checkSerialCommands();
  
  // AP modundayken DNS server'ı işle ve WebSocket'i çalıştırma
  if (wifiSetupStatus.isInAPMode) {
    // Captive portal DNS server'ını işle
    // Bu tüm DNS isteklerini ESP32'nin IP'sine yönlendirir
    dnsServer.processNextRequest();
    delay(10);
    return;
  }
  
  webSocket.loop();
  checkDevices();
  
  // Heartbeat güncelle ve gönder
  static unsigned long lastHeartbeat = 0;
  unsigned long now = millis();
  
  if (now - lastHeartbeat >= HEARTBEAT_INTERVAL) {
    lastHeartbeat = now;
    String heartbeatMsg = createHeartbeatMessage();
    webSocket.sendTXT(heartbeatMsg);
    Serial.println("=== Heartbeat Gönderildi ===");
    Serial.println("Cihaz: " + String(DEVICE_ID) + " - " + String(DEVICE_NAME));
    Serial.println("Uptime: " + String(now / 1000) + " saniye");
    Serial.println("Mesaj: " + heartbeatMsg);
  }
  
  // Görev kuyruğunu işle
  processTaskQueue();
}
